Revit 2024 API
BuiltInFailures.CopyMonitorFailures.GridDeletedSameName Property
 Grid cannot be copied because grid with desired name '[Name]' already exist in a target document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId GridDeletedSameName { get; }
Visual Basic
Public Shared ReadOnly Property GridDeletedSameName As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ GridDeletedSameName {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyMonitorFailures Class
Autodesk.Revit.DB Namespace